app/controllers/orders_controller.rb

  def index
    params[:q] ||= {}
    if params[:q][:deliver_date_lteq].present?
      params[:q][:deliver_date_lteq] = params[:q][:deliver_date_lteq].to_date.end_of_day
    end

    # Filter data by search send by view
    @q = Order.includes(:client).ransack(params[:q])
    # Paginate the result
    @orders = @q.result.page(params[:page]).per(params[:per])
---
SELECT COUNT(*) FROM "orders"