app/controllers/products_controller.rb

SELECT COUNT(*) FROM "products" WHERE "products"."in_trash" = $1  [["in_trash", false]]
---
  def index
    @q = Product.where(in_trash: false).ransack(params[:q])
    @products = @q.result.page params[:page]