app/controllers/supplies_controller.rb

  def index
    @q = Supply.where(in_trash: false).ransack(params[:q])
    @supplies = @q.result.page params[:page]
---
SELECT COUNT(*) FROM "supplies" WHERE "supplies"."in_trash" = $1  [["in_trash", false]]