app/views/products/_form.html.erb

  <select class="multiple-supplies" name="supplies[]" multiple="multiple">
    <% Supply.where(in_trash: false).each do |supply| %>
---
SELECT "supplies".* FROM "supplies" WHERE "supplies"."in_trash" = $1  [["in_trash", false]]